In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
df=pd.read_csv('insurance.csv')

In [3]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
#df.info()

In [5]:
#df.describe()

In [6]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [7]:
df.shape

(1338, 7)

In [8]:
df1=df.copy()
df2=df.copy()
df3=df.copy()
df4=df.copy()

# ENCODING TECHNIQUE

# Without Encoding Technique

In [9]:
df.sex.unique()

array(['female', 'male'], dtype=object)

In [10]:
df.sex=df.sex.replace(['female', 'male'],[1,2])

In [11]:
df.head()

   age  sex     bmi  children smoker     region      charges
0   19    1  27.900         0    yes  southwest  16884.92400
1   18    2  33.770         1     no  southeast   1725.55230
2   28    2  33.000         3     no  southeast   4449.46200
3   33    2  22.705         0     no  northwest  21984.47061
4   32    2  28.880         0     no  northwest   3866.85520

In [12]:
df.smoker.unique()

array(['yes', 'no'], dtype=object)

In [13]:
df.smoker=df.smoker.replace(['yes', 'no'],[3,4])

In [14]:
df.head()

   age  sex     bmi  children  smoker     region      charges
0   19    1  27.900         0       3  southwest  16884.92400
1   18    2  33.770         1       4  southeast   1725.55230
2   28    2  33.000         3       4  southeast   4449.46200
3   33    2  22.705         0       4  northwest  21984.47061
4   32    2  28.880         0       4  northwest   3866.85520

In [15]:
df.region.unique()
#df.smoker.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [16]:
df.region=df.region.replace(['southwest', 'southeast', 'northwest', 'northeast'],[5,6,7,8])

In [17]:
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    1  27.900         0       3       5  16884.92400
1   18    2  33.770         1       4       6   1725.55230
2   28    2  33.000         3       4       6   4449.46200
3   33    2  22.705         0       4       7  21984.47061
4   32    2  28.880         0       4       7   3866.85520

# LABEL ENCODER

In [18]:
from sklearn.preprocessing import LabelEncoder

In [19]:
le=LabelEncoder()

In [20]:
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [21]:
df1.sex=le.fit_transform(df1.sex)

In [22]:
df1.head()

   age  sex     bmi  children smoker     region      charges
0   19    0  27.900         0    yes  southwest  16884.92400
1   18    1  33.770         1     no  southeast   1725.55230
2   28    1  33.000         3     no  southeast   4449.46200
3   33    1  22.705         0     no  northwest  21984.47061
4   32    1  28.880         0     no  northwest   3866.85520

In [23]:
df1.smoker=le.fit_transform(df1.smoker)

In [24]:
df1.head()

   age  sex     bmi  children  smoker     region      charges
0   19    0  27.900         0       1  southwest  16884.92400
1   18    1  33.770         1       0  southeast   1725.55230
2   28    1  33.000         3       0  southeast   4449.46200
3   33    1  22.705         0       0  northwest  21984.47061
4   32    1  28.880         0       0  northwest   3866.85520

In [25]:
df1.region=le.fit_transform(df1.region)

In [26]:
df1.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# Label Encoder Using For loop

In [27]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [28]:
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [29]:
for column in df2.columns:
    if df2[column].dtype==np.number:
        continue
    df2[column]=le.fit_transform(df2[column])

C:\Users\Runa\AppData\Local\Temp/ipykernel_6752/2301689676.py:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df2[column].dtype==np.number:

In [30]:
import warnings as wr
wr.filterwarnings('ignore')
for column in df2.columns:
    if df2[column].dtype==np.number:
        continue
    df2[column]=le.fit_transform(df2[column])

In [31]:
df2.head()

   age  sex     bmi  children  smoker  region      charges
0    1    0  27.900         0       1       3  16884.92400
1    0    1  33.770         1       0       2   1725.55230
2   10    1  33.000         3       0       2   4449.46200
3   15    1  22.705         0       0       1  21984.47061
4   14    1  28.880         0       0       1   3866.85520

# Another way to encode

In [32]:
df3.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [33]:
from pandas.core.dtypes.common import is_numeric_dtype

In [34]:
for column in df3.columns:
    if is_numeric_dtype(df3[column]):
        continue
    else:
        df3[column]=le.fit_transform(df3[column])

In [35]:
df3.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# One Hot Encoder

In [36]:
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [37]:
#df4=df4.copy()
df5=df4.copy()
df6=df4.copy()
df7=df4.copy()
df8=df4.copy()
df9=df4.copy()

In [38]:
dummy=pd.get_dummies(df4['sex'])

In [39]:
dummy.head()

   female  male
0       1     0
1       0     1
2       0     1
3       0     1
4       0     1

In [40]:
df4=df4.drop('sex',axis=1)

In [41]:
df4.head()

   age     bmi  children smoker     region      charges
0   19  27.900         0    yes  southwest  16884.92400
1   18  33.770         1     no  southeast   1725.55230
2   28  33.000         3     no  southeast   4449.46200
3   33  22.705         0     no  northwest  21984.47061
4   32  28.880         0     no  northwest   3866.85520

In [42]:
dummy1=pd.get_dummies(df4['smoker'])

In [43]:
dummy1.head()

   no  yes
0   0    1
1   1    0
2   1    0
3   1    0
4   1    0

In [44]:
df4=df4.drop('smoker',axis=1)

In [45]:
df4.head()

   age     bmi  children     region      charges
0   19  27.900         0  southwest  16884.92400
1   18  33.770         1  southeast   1725.55230
2   28  33.000         3  southeast   4449.46200
3   33  22.705         0  northwest  21984.47061
4   32  28.880         0  northwest   3866.85520

In [46]:
dummy2=pd.get_dummies(df4['region'])

In [47]:
dummy2.head()

   northeast  northwest  southeast  southwest
0          0          0          0          1
1          0          0          1          0
2          0          0          1          0
3          0          1          0          0
4          0          1          0          0

In [48]:
df4=df4.drop('region',axis=1)

In [49]:
df4.head()

   age     bmi  children      charges
0   19  27.900         0  16884.92400
1   18  33.770         1   1725.55230
2   28  33.000         3   4449.46200
3   33  22.705         0  21984.47061
4   32  28.880         0   3866.85520

In [50]:
dummy=pd.get_dummies(df5['sex'],prefix='encoded')

In [51]:
dummy.head()

   encoded_female  encoded_male
0               1             0
1               0             1
2               0             1
3               0             1
4               0             1

In [52]:
dummy1=pd.get_dummies(df5['smoker'],prefix='encoded')

In [53]:
dummy1.head()

   encoded_no  encoded_yes
0           0            1
1           1            0
2           1            0
3           1            0
4           1            0

In [54]:
dummy2=pd.get_dummies(df5['region'],prefix='encoded')

In [55]:
dummy2.head()

   encoded_northeast  encoded_northwest  encoded_southeast  encoded_southwest
0                  0                  0                  0                  1
1                  0                  0                  1                  0
2                  0                  0                  1                  0
3                  0                  1                  0                  0
4                  0                  1                  0                  0

In [56]:
dummy=pd.get_dummies(df6['sex'],prefix='sex',drop_first=True)

In [57]:
dummy.head()

   sex_male
0         0
1         1
2         1
3         1
4         1

In [58]:
dummy1=pd.get_dummies(df6['smoker'],prefix='smoker',drop_first=True)

In [59]:
dummy1.head()

   smoker_yes
0           1
1           0
2           0
3           0
4           0

In [60]:
dummy2=pd.get_dummies(df6['region'],prefix='region',drop_first=True)

In [61]:
dummy2.head()

   region_northwest  region_southeast  region_southwest
0                 0                 0                 1
1                 0                 1                 0
2                 0                 1                 0
3                 1                 0                 0
4                 1                 0                 0

# concatenation

In [62]:
new_df4=pd.concat([df4,dummy,dummy1,dummy2,],axis=1)

In [63]:
new_df4.head()

,age,bmi,children,charges,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

In [64]:
y=new_df4.charges
x=new_df4.drop('charges',axis=1)

In [65]:
x.head()

,age,bmi,children,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27.900,0,0,1,0,0,1
1,18,33.770,1,1,0,0,1,0
2,28,33.000,3,1,0,0,1,0
3,33,22.705,0,1,0,1,0,0
4,32,28.880,0,1,0,1,0,0

In [66]:
y.head()

0    16884.92400
1     1725.55230
2     4449.46200
3    21984.47061
4     3866.85520
Name: charges, dtype: float64

# One Hot Encoder using For Loop

In [67]:
col=['sex','smoker','region']
for column in col:
    one=pd.get_dummies(df5[column])
    df5=pd.concat([df5,one],axis=1).drop(column,axis=1)

In [68]:
df5.head()

,age,bmi,children,charges,female,male,no,yes,northeast,northwest,southeast,southwest
0,19,27.900,0,16884.92400,1,0,0,1,0,0,0,1
1,18,33.770,1,1725.55230,0,1,1,0,0,0,1,0
2,28,33.000,3,4449.46200,0,1,1,0,0,0,1,0
3,33,22.705,0,21984.47061,0,1,1,0,0,1,0,0
4,32,28.880,0,3866.85520,0,1,1,0,0,1,0,0

In [69]:
col=['sex','smoker','region']
for column in col:
    one=pd.get_dummies(df6[column],drop_first=True)
    df6=pd.concat([df6,one],axis=1).drop(column,axis=1)

In [70]:
df6.head()

,age,bmi,children,charges,male,yes,northwest,southeast,southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

# Ordinal Encoder

In [71]:
df7.sex.unique()

array(['female', 'male'], dtype=object)

In [72]:
gender=['female','male']

In [73]:
from sklearn.preprocessing import OrdinalEncoder

In [74]:
ordinal=OrdinalEncoder(categories=[gender])

In [75]:
ordinal

OrdinalEncoder(categories=[['female', 'male']])

In [76]:
df7.smoker.unique()

array(['yes', 'no'], dtype=object)

In [77]:
Addicted=['yes','no']

In [78]:
ordinal=OrdinalEncoder(categories=[Addicted])

In [79]:
ordinal

OrdinalEncoder(categories=[['yes', 'no']])

In [80]:
df7.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [81]:
pole=['southwest', 'southeast', 'northwest', 'northeast']

In [82]:
ordinal=OrdinalEncoder(categories=[pole])

In [83]:
ordinal

OrdinalEncoder(categories=[['southwest', 'southeast', 'northwest',
                            'northeast']])

In [84]:
#encoded=ordinal.fit_transform(df7[['sex']])

In [85]:
encoded=ordinal.fit_transform(df7[['region']])

In [86]:
encoded

array([[0.],
       [1.],
       [1.],
       ...,
       [1.],
       [0.],
       [2.]])

In [87]:
en=pd.DataFrame(encoded,columns=['region'])

In [88]:
en.head()

   region
0     0.0
1     1.0
2     1.0
3     2.0
4     2.0

In [89]:
df7.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [93]:
cols=['sex','smoker','region']
for col in cols:
    unique=df8[col].unique()
    df8[col]=OrdinalEncoder(categories=[unique]).fit_transform(df8[[col]])

In [94]:
df8.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520